---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.ObjectCreated
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.ObjectCreated

An informational message. An object - a face, edge, solid, etc. - has been created successfully.